RT-Thread/rt-thread/bsp/bl808/m0/libraries/platform/soc/bl808/bl808_e907_std/bl808_bsp_driver/std_drv/src/bl808_i2c.c
    /* set i2c clk,default is 400000,max support clk is 400000 */
    if (cfg->clk == 0 || cfg->clk > 400000){
        I2C_ClockSet(i2cNo, 400000);
    } else {
        I2C_ClockSet(i2cNo, cfg->clk);
    }

    /* Disable clock gate when use I2C0 */
    if (I2C0_ID == i2cNo) {
        GLB_PER_Clock_UnGate(GLB_AHB_CLOCK_I2C);
    } else if (I2C1_ID == i2cNo) {
        GLB_PER_Clock_UnGate(GLB_AHB_CLOCK_I2C1);
    }

    /* I2C write config */
    tmpVal = BL_RD_REG(I2Cx, I2C_CONFIG);

    if (direct == I2C_WRITE) {
        tmpVal = BL_CLR_REG_BIT(tmpVal, I2C_CR_I2C_PKT_DIR);
    } else {
        tmpVal = BL_SET_REG_BIT(tmpVal, I2C_CR_I2C_PKT_DIR);
    }

    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, I2C_CR_I2C_SLV_ADDR, cfg->slaveAddr);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, I2C_CR_I2C_10B_ADDR_EN, cfg->slaveAddr10Bit);

    if (cfg->subAddrSize > 0) {
        tmpVal = BL_SET_REG_BIT(tmpVal, I2C_CR_I2C_SUB_ADDR_EN);
        tmpVal = BL_SET_REG_BITS_VAL(tmpVal, I2C_CR_I2C_SUB_ADDR_BC, cfg->subAddrSize - 1);
    } else {
        tmpVal = BL_CLR_REG_BIT(tmpVal, I2C_CR_I2C_SUB_ADDR_EN);
    }

    /* align clock when 1 master*/
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, I2C_CR_I2C_SCL_SYNC_EN, DISABLE);

    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, I2C_CR_I2C_PKT_LEN, cfg->dataSize - 1);
    BL_WR_REG(I2Cx, I2C_CONFIG, tmpVal);

    /* Set sub address */
    BL_WR_REG(I2Cx, I2C_SUB_ADDR, cfg->subAddr);

#ifndef BFLB_USE_HAL_DRIVER
    Interrupt_Handler_Register(I2C0_IRQn, I2C0_IRQHandler);
    Interrupt_Handler_Register(I2C1_IRQn, I2C1_IRQHandler);
    Interrupt_Handler_Register(I2C2_IRQn, I2C2_IRQHandler);
    Interrupt_Handler_Register(I2C3_IRQn, I2C2_IRQHandler);
#endif
}

/****************************************************************************/ /**
 * @brief  Set de-glitch function cycle count value
 *
 * @param  i2cNo: I2C ID type
 * @param  cnt: De-glitch function cycle count
 *
 * @return SUCCESS
 *
*******************************************************************************/
BL_Err_Type I2C_SetDeglitchCount(I2C_ID_Type i2cNo, uint8_t cnt)
{
    uint32_t tmpVal;
    uint32_t I2Cx = i2cAddr[i2cNo];

    /* Check the parameters */
    CHECK_PARAM(IS_I2C_ID_TYPE(i2cNo));

    tmpVal = BL_RD_REG(I2Cx, I2C_CONFIG);

    if (cnt > 0) {
        /* enable de-glitch function */
        tmpVal = BL_SET_REG_BIT(tmpVal, I2C_CR_I2C_DEG_EN);
    } else if (cnt == 0) {
        /* disable de-glitch function */
        tmpVal = BL_CLR_REG_BIT(tmpVal, I2C_CR_I2C_DEG_EN);
    } else {
        return ERROR;
    }

    /* Set count value */
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, I2C_CR_I2C_DEG_CNT, cnt);
    BL_WR_REG(I2Cx, I2C_CONFIG, tmpVal);

    return SUCCESS;
}

/****************************************************************************/ /**
 * @brief  Set i2c prd
 *
 * @param  i2cNo: I2C ID type
 * @param  phase: I2C phase value
 *
 * @return None
 *
*******************************************************************************/
void I2C_SetPrd(I2C_ID_Type i2cNo, uint8_t phase)
{
    uint32_t tmpVal;
    uint32_t I2Cx = i2cAddr[i2cNo];

    /* Check the parameters */
    CHECK_PARAM(IS_I2C_ID_TYPE(i2cNo));

    //phase_cycles = (32000000 / phase / 4) - 1;
    tmpVal = BL_RD_REG(I2Cx, I2C_PRD_START);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, I2C_CR_I2C_PRD_S_PH_0, phase);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, I2C_CR_I2C_PRD_S_PH_1, phase);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, I2C_CR_I2C_PRD_S_PH_2, phase);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, I2C_CR_I2C_PRD_S_PH_3, phase);
    BL_WR_REG(I2Cx, I2C_PRD_START, tmpVal);
    tmpVal = BL_RD_REG(I2Cx, I2C_PRD_STOP);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, I2C_CR_I2C_PRD_P_PH_0, phase);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, I2C_CR_I2C_PRD_P_PH_1, phase);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, I2C_CR_I2C_PRD_P_PH_2, phase);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, I2C_CR_I2C_PRD_P_PH_3, phase);
    BL_WR_REG(I2Cx, I2C_PRD_STOP, tmpVal);
    tmpVal = BL_RD_REG(I2Cx, I2C_PRD_DATA);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, I2C_CR_I2C_PRD_D_PH_0, phase);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, I2C_CR_I2C_PRD_D_PH_1, phase);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, I2C_CR_I2C_PRD_D_PH_2, phase);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, I2C_CR_I2C_PRD_D_PH_3, phase);
    BL_WR_REG(I2Cx, I2C_PRD_DATA, tmpVal);
}

/****************************************************************************/ /**
 * @brief  I2C set scl output clock
 *
 * @param  i2cNo: I2C ID type
 * @param  clk: Clock set
 *
 * @return None
 *
*******************************************************************************/
void I2C_ClockSet(I2C_ID_Type i2cNo, uint32_t clk)
{
    uint32_t bclk = 0;

    /* Check the parameters */
    CHECK_PARAM(IS_I2C_ID_TYPE(i2cNo));

    if (i2cNo == I2C0_ID || i2cNo == I2C1_ID) {
        bclk = Clock_System_Clock_Get(BL_SYSTEM_CLOCK_MCU_PBCLK);

        if (clk >= 100000) {
            GLB_Set_I2C_CLK(1, GLB_I2C_CLK_BCLK, 0);
            I2C_SetPrd(i2cNo, bclk / (clk * 4) - 1);
        } else if (clk >= 8000) {
            GLB_Set_I2C_CLK(1, GLB_I2C_CLK_BCLK, 9);
            I2C_SetPrd(i2cNo, bclk / 10 / (clk * 4) - 1);
        } else if (clk >= 800) {
            GLB_Set_I2C_CLK(1, GLB_I2C_CLK_BCLK, 99);
            I2C_SetPrd(i2cNo, bclk / 100 / (clk * 4) - 1);
        } else {
            GLB_Set_I2C_CLK(1, GLB_I2C_CLK_BCLK, 255);
            I2C_SetPrd(i2cNo, bclk / 256 / (clk * 4) - 1);
        }
    } else if (i2cNo == I2C0_MM_ID) {
        bclk = Clock_System_Clock_Get(BL_SYSTEM_CLOCK_DSP_PBCLK);

        if (clk >= 100000) {
            GLB_Set_DSP_I2C0_CLK(1, 1, 1, 0);
            I2C_SetPrd(i2cNo, bclk / (clk * 4) - 1);
        } else if (clk >= 8000) {
            GLB_Set_DSP_I2C0_CLK(1, 1, 1, 9);
            I2C_SetPrd(i2cNo, bclk / 10 / (clk * 4) - 1);
        } else if (clk >= 800) {
            GLB_Set_DSP_I2C0_CLK(1, 1, 1, 99);
            I2C_SetPrd(i2cNo, bclk / 100 / (clk * 4) - 1);
        } else {
            GLB_Set_DSP_I2C0_CLK(1, 1, 1, 255);
            I2C_SetPrd(i2cNo, bclk / 256 / (clk * 4) - 1);
        }
    } else if (i2cNo == I2C1_MM_ID) {
        bclk = Clock_System_Clock_Get(BL_SYSTEM_CLOCK_DSP_PBCLK);

